{
  "session_id": "20250714_175202",
  "title": "Welcome",
  "content": "# Welcome To Tequill\n\n**Tequill** is a desktop-based markdown notebook engineered for professionals in quantitative finance, academia, and technical fields. Built with PySide6 and QtWebEngine, it combines structured writing, math rendering, and clean exporting, all in one local-first interface. With full Markdown and LaTeX support, Tequill is ideal for research notes, whitepaper drafting, strategy documentation, and reproducible thought capture.\n\n---\n\n## Core Features\n\n### Structured Markdown Editing\nA clean, distraction-free editor built on `QTextEdit`, optimized for Markdown syntax. Write faster with formatting flexibility and immediate rendering support.\n\n### Live Preview with MathJax\nRender content in real time with a built-in `QWebEngineView`. Full LaTeX integration via MathJax enables inline and block equations, no external compilation required.\n\n### Session Management\nEach notebook is a self-contained session. Sessions can be created, renamed, deleted, or quickly reopened from a persistent sidebar manager.\n\n### Multi-Format Exporting\nExport notebooks to:\n- **HTML** (with MathJax embedding)\n- **PDF** (print-quality via Qt’s native rendering)\n- **Markdown (.md)** (raw content for Git workflows or future automation)\n\nAll exports retain mathematical fidelity and formatting consistency.\n\n### Customizable UI Panels\n- Hide or reveal the **notebook manager** with a single toggle  \n- Adjustable **split panels** allow flexible focus on editing vs. rendered view  \n- Clean light-mode stylesheet designed for technical clarity and typographic comfort\n\n---\n\n## Built for Professionals\n\nTequill is not a note-taking toy. It's designed for:\n\n- **Academics & Researchers**: Draft research notes, literature reviews, and papers with real math support.\n- **Quantitative Analysts**: Document model assumptions, derivations, and results.\n- **Engineers & Developers**: Maintain internal documentation, technical design notes, or blog-ready content.\n- **Knowledge Architects**: Structure thoughts, export to clean formats, and retain control over content lifecycle.\n\n---\n\n## Under the Hood\n\n- **Framework**: PySide6 (Qt for Python)  \n- **Rendering Engine**: QtWebEngine (Chromium-based)  \n- **Markdown Parser**: `markdown2`  \n- **Math Typesetting**: MathJax v3 (LaTeX)  \n- **Export Engine**: Native Qt PDF and HTML output  \n\n---\n\n## Local-First, Offline-Ready\n\nTequill is fully offline. Your content remains local and private — ideal for secure environments, finance institutions, or research workflows where data compliance and intellectual property control matter.\n\n---\n\n## Philosophy\n\n*\"Clarity precedes mastery.\"*  \n\nTequill is designed around the principle that structured thought is the foundation of high-leverage work. Whether you're modeling derivatives or composing a thesis, your tools should respect your process, not get in the way of it.",
  "created_at": "2025-07-14T17:52:02.229316",
  "updated_at": "2025-07-14T20:54:25.788896"
}